<h1 style="color:green; font-size:30px; font-weight:700; text-align:center">
    <u><b>Part 3: MySQL DB</b></u>  
</h1> 

<p></p> 
<strong> Author:</strong> Gurtej Bains <br> 
<strong> Data Source:</strong> https://www.imdb.com/interfaces/  <br> 
<strong> Last Updated: </strong>  <br>  
<strong> Problem Statement:</strong> <br>

<h1 style="color:green"><b>Importing Modules</b> </h1>

## Import Libraries

In [1]:
# import libraries  

# Numpy
import numpy as np

# Pandas
import pandas as pd

# MatPlotLib
import matplotlib.pyplot as plt

# Seaborn
import seaborn as sns

# MissingNo
import missingno as msno

# SQL related 
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"

from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

# suppress warnings
import warnings
warnings.filterwarnings("ignore")

# for directory 
import os

# TQDM
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook

## Create Database

In [2]:
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [3]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

## Color class

In [5]:
# Color class to make print look pretty  
class color:
   PURPLE = '\033[95m'
   CYAN = '\033[96m'
   DARKCYAN = '\033[36m'
   BLUE = '\033[94m'
   GREEN = '\033[92m'
   YELLOW = '\033[93m'
   RED = '\033[91m'
   BOLD = '\033[1m'
   UNDERLINE = '\033[4m'
   END = '\033[0m'

print(color.BOLD + 'Hello, World!' + color.END)

Hello, World!

## Create Database

In [6]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

<h1 style="color:green"><b>Importing Data</b> </h1>

## basics data

In [7]:
# read file 
basics = pd.read_csv(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\title_basics.csv.gz")

# keep select columns
basics=basics.drop(columns=['titletype', 'originaltitle', 'isadult', 'endyear'])

# set index 
#basics= basics.set_index('tconst')

# qa
basics.head()

,tconst,primarytitle,startyear,runtimeminutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

## ratings data

In [8]:
# read data 
ratings = pd.read_csv(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\title_ratings.csv.gz")

# set index 
#ratings= ratings.set_index('tconst')

# qa
ratings.head()

      tconst  averagerating  numvotes
0  tt0000001            5.7      1953
1  tt0000002            5.8       264
2  tt0000005            6.2      2587
3  tt0000006            5.1       177
4  tt0000007            5.4       812

## TMDB API data

In [9]:
# Import data 
tmdbi_combined = pd.read_csv(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\tmdb_results_combined.csv.gz")

# select columns 
tmdbi_combined = tmdbi_combined[['imdb_id', 'revenue', 'budget', 'certification']]

# Remove 0 values if any  
condition=['0']
tmdbi_combined = tmdbi_combined[~tmdbi_combined.imdb_id.isin(condition)]

# set index 
#tmdbi_combined= tmdbi_combined.set_index('imdb_id')

# qa
tmdbi_combined.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

<h1 style="color:green"><b>Normalize Data</b> </h1>

In [11]:
# split to parse the string 
new_genres = basics["genres"].str.split(",")

# creating new dataframe 
temp_df = pd.DataFrame({'genres': [val for sublist in new_genres for val in sublist]})

# rename the index 
temp_df.index.names = ['id']

# qa 
temp_df.head(2)

     genres
id
0    Comedy
1   Fantasy

## Create genres table/dataframe

In [12]:
q = """
select row_number() over (order by genres) as genre_id, genres
from (SELECT distinct genres
        from temp_df 
        order by 1) temp 
order by 1

"""
genres = pysqldf(q)
genres

    genre_id      genres
0          1      Action
1          2       Adult
2          3   Adventure
3          4   Animation
4          5   Biography
5          6      Comedy
6          7       Crime
7          8       Drama
8          9      Family
9         10     Fantasy
10        11   Game-Show
11        12     History
12        13      Horror
13        14       Music
14        15     Musical
15        16     Mystery
16        17        News
17        18  Reality-TV
18        19     Romance
19        20      Sci-Fi
20        21       Short
21        22       Sport
22        23   Talk-Show
23        24    Thriller
24        25         War
25        26     Western

## Create title_genres table/dataframe

In [13]:
# Modify the basics dataframe
basics_exploded = basics.assign(genres_new=basics['genres'].str.split(',')).explode('genres')
basics_exploded = basics_exploded.explode('genres_new')

# reset index 
basics_exploded = basics_exploded.reset_index(drop=True)

# qa
basics_exploded.head()

,tconst,primarytitle,startyear,runtimeminutes,genres,genres_new
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
2,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
3,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
4,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama

In [14]:
# Merge datasets to make new datafram 
title_genres = pd.merge(basics_exploded, genres, how='inner', left_on='genres_new', right_on='genres')

# Dro punwanted columns 
title_genres = title_genres.drop(columns=['primarytitle', 'startyear', 'runtimeminutes', 'genres_x', 'genres_new', 'genres_y'])

# reset index 
title_genres = title_genres.reset_index(drop=True)

# qa
title_genres[title_genres['tconst']=='tt0035423']

          tconst  genre_id
0      tt0035423         6
25152  tt0035423        10
28965  tt0035423        19

In [15]:
title_genres.head()

      tconst  genre_id
0  tt0035423         6
1  tt0088751         6
2  tt0100275         6
3  tt0108549         6
4  tt0118652         6

## Updated basics table after normalization

In [16]:
# drop the genres column as the dataframe is normalized 
basics = basics.drop(columns=['genres'])
basics.head(2)

,tconst,primarytitle,startyear,runtimeminutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70

<h1 style="color:green"><b>Schema definition & create table</b> </h1>

## basics table

In [17]:
# Calculate string lengths 
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primarytitle'].fillna('').map(len).max()

# Create a schema dictonary 
df_schema = {
    'tconst':String(key_len+1), 
    'primarytitle':Text(title_len+1),
    'startyear':Integer(),
    'runtimeminutes':Integer()}

In [18]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)

85498

In [19]:
# Add primary key 
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM title_basics LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primarytitle,startyear,runtimeminutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

## ratings table

In [21]:
# Calculate string lengths 
key_len = ratings['tconst'].fillna('').map(len).max()

# Create a schema dictonary 
df_schema = {
    "tconst":String(key_len+1), 
    'averagerating':Float(),
    'numvotes':Integer()}

In [22]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)

489321

In [23]:
# Add primary key 
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [24]:
# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM title_ratings LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averagerating  numvotes
0  tt0000001            5.7      1953
1  tt0000002            5.8       264
2  tt0000005            6.2      2587
3  tt0000006            5.1       177
4  tt0000007            5.4       812

## TMDB table

In [34]:
# Calculate string lengths 
key_len = tmdbi_combined['imdb_id'].fillna('').map(len).max()
cert_len = tmdbi_combined['certification'].fillna('').map(len).max()

# Create a schema dictonary 
df_schema = {
    "imdb_id":String(key_len+1), 
    'revenue':Float(),
    'budget':Float(), 
    'certification':String(cert_len+1)}

In [35]:
# Save to sql with dtype and index=False
tmdbi_combined.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2525

In [36]:
# Add primary key 
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [37]:
# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM tmdb_data LIMIT 5
"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

## genres table

In [40]:
# Calculate string lengths 
genres_len = genres['genres'].fillna('').map(len).max()

# Create a schema dictonary 
df_schema = {
    "genre_id":Integer(), 
    'genres':String(genres_len+1)}

In [41]:
# Save to sql with dtype and index=False
genres.to_sql('genres', engine, dtype=df_schema, if_exists='replace', index=False)

26

In [42]:
# Add primary key 
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [43]:
# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM genres LIMIT 5
"""
pd.read_sql(q, engine)

   genre_id     genres
0         1     Action
1         2      Adult
2         3  Adventure
3         4  Animation
4         5  Biography

## title genres table

In [48]:
# Calculate string lengths 
key_len = title_genres['tconst'].fillna('').map(len).max()

# Create a schema dictonary 
df_schema = {
    "tconst":String(key_len+1),
    "genre_id":Integer()}

In [49]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)

159683

In [50]:
# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM title_genres LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         6
1  tt0088751         6
2  tt0100275         6
3  tt0108549         6
4  tt0118652         6

## Show Tables: QA Step

In [51]:
# Display the SQL table names using an SQL query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data